#### 📋 Linode Terraform Plan

```

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu planned the following actions, but then encountered a problem:

  # linode_domain.kaylabs will be created
  + resource "linode_domain" "kaylabs" {
      + domain    = "kaylabs.cc"
      + id        = (known after apply)
      + soa_email = "kay@kaylabs.cc"
      + status    = (known after apply)
      + tags      = (known after apply)
      + type      = "master"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + domain_id = (known after apply)

Warning: Deprecated attribute

  on main.tf line 59, in resource "linode_domain_record" "proxy":
  59:   target      = linode_instance.proxy.ip_address

The attribute "ip_address" is deprecated. Refer to the provider documentation
for details.

(and one more similar warning elsewhere)

Error: expected length of root_pass to be in the range (11 - 128), got 

  with linode_instance.proxy,
  on main.tf line 6, in resource "linode_instance" "proxy":
   6:   root_pass       = var.root_pass

::error::OpenTofu exited with code 1.
```

*Triggered by @bytebotapp[bot]*